Revit 2026 API
AdaptiveComponentFamilyUtils Class
 An interface for Adaptive Component Instances.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.AdaptiveComponentFamilyUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class AdaptiveComponentFamilyUtils
Public NotInheritable Class AdaptiveComponentFamilyUtils
public ref class AdaptiveComponentFamilyUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AdaptiveComponentFamilyUtils = class end
The AdaptiveComponentFamilyUtils type exposes the following members.
Methods
Name | Description
GetNumberOfAdaptivePoints |  Gets number of Adaptive Point Elements in Adaptive Component Family.
GetNumberOfPlacementPoints |  Gets number of Placement Point Elements in Adaptive Component Family.
GetNumberOfShapeHandlePoints |  Gets number of Shape Handle Point Elements in Adaptive Component Family.
GetPlacementNumber |  Gets Placement number of an Adaptive Placement Point.
GetPointConstraintType |  Gets constrain type of an Adaptive Shape Handle Point.
GetPointOrientationType |  Gets orientation type of an Adaptive Placement Point.
IsAdaptiveComponentFamily |  Verifies if the Family is an Adaptive Component Family.
IsAdaptivePlacementPoint |  Verifies if the Reference Point is an Adaptive Placement Point.
IsAdaptivePoint |  Verifies if the Reference Point is an Adaptive Point.
IsAdaptiveShapeHandlePoint |  Verifies if the Reference Point is an Adaptive Shape Handle Point.
MakeAdaptivePoint |  Makes Reference Point an Adaptive Point or makes an Adaptive Point a Reference Point.
SetPlacementNumber |  Sets Placement Number of an Adaptive Placement Point.
SetPointConstraintType |  Sets constrain type of an Adaptive Shape Handle Point.
SetPointOrientationType |  Sets orientation type of an Adaptive Placement Point.
Top
See Also
Reference
Autodesk.Revit.DB Namespace